In [1]:
%load_ext sql
%sql sqlite:///ISI-sql_Baloncesto.db

C:\Users\Sandra\Anaconda2\lib\site-packages\IPython\config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
C:\Users\Sandra\Anaconda2\lib\site-packages\IPython\utils\traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

u'Connected: None@ISI-sql_Baloncesto.db'

# COMUNIDADES_AUTONOMAS

!!! Incluyo IF NOT EXISTS para poder volver a pasar por esta celda y que no me salte error al pulsar Shift+Intro seguidas veces.

In [2]:
%%sql
CREATE TABLE IF NOT EXISTS Comunidades_Autonomas
(nombre VARCHAR(30),
 PRIMARY KEY (nombre)
);

Done.

[]

!!! La siguiente celda la ejecuto para poder volver a ejecutar la inserción de valores si necesito hacer cambios (ya que la restricción de Primary Key no me permite insertar el mismo valor dos veces) y de nuevo para que no me salte error al pulsar Shift+Intro seguidas veces.

In [3]:
%%sql
DELETE FROM Comunidades_Autonomas;
SELECT * FROM Comunidades_Autonomas

4 rows affected.
Done.

[]

In [4]:
%%sql
INSERT INTO Comunidades_Autonomas(nombre)
VALUES ('Madrid');
INSERT INTO Comunidades_Autonomas(nombre)
VALUES ('Andalucia');
INSERT INTO Comunidades_Autonomas(nombre)
VALUES ('Galicia');
INSERT INTO Comunidades_Autonomas(nombre)
VALUES ('Cataluña');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%sql SELECT * FROM Comunidades_Autonomas

Done.

[(u'Madrid',), (u'Andalucia',), (u'Galicia',), (u'Catalu\xf1a',)]

# CIUDADES

* Entidad débil con respecto a Comunidades_Autonomas

In [30]:
%%sql
CREATE TABLE IF NOT EXISTS Ciudades
(nombre VARCHAR(30),
 com_autonoma VARCHAR(30) NOT NULL,
 PRIMARY KEY (nombre, com_autonoma),
 FOREIGN KEY (com_autonoma) REFERENCES Comunidades_Autonomas(nombre)
 ON DELETE CASCADE
);

Done.
Done.

[]

In [31]:
%%sql
DELETE FROM Ciudades;
SELECT * FROM Ciudades

0 rows affected.
Done.

[]

In [32]:
%%sql
INSERT INTO Ciudades(nombre, com_autonoma)
VALUES ('Fuenlabrada', 'Madrid');
INSERT INTO Ciudades(nombre, com_autonoma)
VALUES ('Mostoles', 'Madrid');
INSERT INTO Ciudades(nombre, com_autonoma)
VALUES ('Alcorcon', 'Madrid');
INSERT INTO Ciudades(nombre, com_autonoma)
VALUES ('Sevilla', 'Andalucia');
INSERT INTO Ciudades(nombre, com_autonoma)
VALUES ('Cordoba', 'Andalucia');
INSERT INTO Ciudades(nombre, com_autonoma)
VALUES ('Vigo', 'Galicia');
INSERT INTO Ciudades(nombre, com_autonoma)
VALUES ('Pontevedra', 'Galicia');
INSERT INTO Ciudades(nombre, com_autonoma)
VALUES ('Barcelona', 'Cataluña');
INSERT INTO Ciudades(nombre, com_autonoma)
VALUES ('Girona', 'Cataluña');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [33]:
%sql SELECT * FROM Ciudades

Done.

[(u'Fuenlabrada', u'Madrid'),
 (u'Mostoles', u'Madrid'),
 (u'Alcorcon', u'Madrid'),
 (u'Sevilla', u'Andalucia'),
 (u'Cordoba', u'Andalucia'),
 (u'Vigo', u'Galicia'),
 (u'Pontevedra', u'Galicia'),
 (u'Barcelona', u'Catalu\xf1a'),
 (u'Girona', u'Catalu\xf1a')]

# EQUIPOS
* Entidad débil con respecto a Ciudades

Es necesario añadir la comunidad autónoma ya que de no hacerlo no podríamos tener dos equipos en los que coincidiera el nombre y la ciudad pertenecientes a distintas comunidades autónomas.

In [34]:
%%sql
CREATE TABLE IF NOT EXISTS Equipos
(nombre varchar(30),
 ciudad VARCHAR(30) NOT NULL,
 com_autonoma VARCHAR(30) NOT NULL,
 PRIMARY KEY (nombre, ciudad),
 FOREIGN KEY (ciudad) REFERENCES Ciudades(nombre)
 ON DELETE CASCADE,
 FOREIGN KEY (com_autonoma) REFERENCES Comunidades_Autonomas(nombre)
 ON DELETE CASCADE
);

Done.
Done.

[]

In [35]:
%%sql
DELETE FROM Equipos;
SELECT * FROM Equipos

0 rows affected.
Done.

[]

In [36]:
%%sql
INSERT INTO Equipos(nombre, ciudad, com_autonoma)
VALUES ('CB Fuenla', 'Fuenlabrada', 'Madrid');
INSERT INTO Equipos(nombre, ciudad, com_autonoma)
VALUES ('CB Mostoles', 'Mostoles', 'Madrid');
INSERT INTO Equipos(nombre, ciudad, com_autonoma)
VALUES ('CB Alcorcon', 'Alcorcon', 'Madrid');
INSERT INTO Equipos(nombre, ciudad, com_autonoma)
VALUES ('CB Sevilla', 'Sevilla', 'Andalucia');
INSERT INTO Equipos(nombre, ciudad, com_autonoma)
VALUES ('CB Cordoba', 'Cordoba', 'Andalucia');
INSERT INTO Equipos(nombre, ciudad, com_autonoma)
VALUES ('CB Estudiantes', 'Vigo', 'Galicia');
INSERT INTO Equipos(nombre, ciudad, com_autonoma)
VALUES ('CB Pontevedra', 'Pontevedra', 'Galicia');
INSERT INTO Equipos(nombre, ciudad, com_autonoma)
VALUES ('CB Estudiantes', 'Barcelona', 'Cataluña');
INSERT INTO Equipos(nombre, ciudad, com_autonoma)
VALUES ('CB Girona', 'Girona', 'Cataluña');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [37]:
%sql SELECT * FROM Equipos

Done.

[(u'CB Fuenla', u'Fuenlabrada', u'Madrid'),
 (u'CB Mostoles', u'Mostoles', u'Madrid'),
 (u'CB Alcorcon', u'Alcorcon', u'Madrid'),
 (u'CB Sevilla', u'Sevilla', u'Andalucia'),
 (u'CB Cordoba', u'Cordoba', u'Andalucia'),
 (u'CB Estudiantes', u'Vigo', u'Galicia'),
 (u'CB Pontevedra', u'Pontevedra', u'Galicia'),
 (u'CB Estudiantes', u'Barcelona', u'Catalu\xf1a'),
 (u'CB Girona', u'Girona', u'Catalu\xf1a')]

# ENTRENADORES

In [17]:
%%sql
CREATE TABLE IF NOT EXISTS Entrenadores
(nif VARCHAR(10),
 nombre VARCHAR(30),
 apellidos VARCHAR(30),
 fecha_nto DATETIME,
 PRIMARY KEY (nif)
);

Done.

[]

In [18]:
%%sql
DELETE FROM Entrenadores;
SELECT * FROM Entrenadores

9 rows affected.
Done.

[]

In [19]:
%%sql
INSERT INTO Entrenadores(nif, nombre, apellidos, fecha_nto)
VALUES ('58963633N', 'Juan', 'Castro', '1970-12-31 00:00:00');
INSERT INTO Entrenadores(nif, nombre, apellidos, fecha_nto)
VALUES ('85967585L', 'Sara', 'Barrete', '1982-08-11 00:00:00');
INSERT INTO Entrenadores(nif, nombre, apellidos, fecha_nto)
VALUES ('57656799A', 'Marcos', 'Beltran', '1989-10-03 00:00:00');
INSERT INTO Entrenadores(nif, nombre, apellidos, fecha_nto)
VALUES ('02589658J', 'Maria', 'Lopez', '1975-05-04 00:00:00');
INSERT INTO Entrenadores(nif, nombre, apellidos, fecha_nto)
VALUES ('18992232H', 'Miguel', 'Martinez', '1979-01-13 00:00:00');
INSERT INTO Entrenadores(nif, nombre, apellidos, fecha_nto)
VALUES ('55225589F', 'Lara', 'Copido', '1981-03-31 00:00:00');
INSERT INTO Entrenadores(nif, nombre, apellidos, fecha_nto)
VALUES ('63272983D', 'Jose', 'Salgado', '1976-09-08 00:00:00');
INSERT INTO Entrenadores(nif, nombre, apellidos, fecha_nto)
VALUES ('47787543G', 'Marta', 'Garrido', '1974-02-15 00:00:00');
INSERT INTO Entrenadores(nif, nombre, apellidos, fecha_nto)
VALUES ('09099154Y', 'Hector', 'de la Fuente', '1980-11-30 00:00:00');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%sql SELECT * FROM Entrenadores

Done.

[(u'58963633N', u'Juan', u'Castro', u'1970-12-31 00:00:00'),
 (u'85967585L', u'Sara', u'Barrete', u'1982-08-11 00:00:00'),
 (u'57656799A', u'Marcos', u'Beltran', u'1989-10-03 00:00:00'),
 (u'02589658J', u'Maria', u'Lopez', u'1975-05-04 00:00:00'),
 (u'18992232H', u'Miguel', u'Martinez', u'1979-01-13 00:00:00'),
 (u'55225589F', u'Lara', u'Copido', u'1981-03-31 00:00:00'),
 (u'63272983D', u'Jose', u'Salgado', u'1976-09-08 00:00:00'),
 (u'47787543G', u'Marta', u'Garrido', u'1974-02-15 00:00:00'),
 (u'09099154Y', u'Hector', u'de la Fuente', u'1980-11-30 00:00:00')]

# JUGADORES

In [21]:
%%sql
CREATE TABLE IF NOT EXISTS Jugadores
(nif VARCHAR(10),
 nombre VARCHAR(30),
 apellidos VARCHAR(30),
 fecha_nto DATETIME,
 altura FLOAT,
 PRIMARY KEY (nif)
);

Done.
Done.

[]

In [78]:
%%sql
DELETE FROM Jugadores;
SELECT * FROM Jugadores

15 rows affected.
Done.

[]

In [79]:
%%sql
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('15696688S', 'Miguel', 'Sanchez', '1970-12-31 00:00:00', 1.98);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('42322521A', 'Cristian', 'Lopez', '1970-12-31 00:00:00', 1.92);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('24145854W', 'Alfredo', 'Landa', '1970-12-31 00:00:00', 1.95);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('78558651W', 'Antonio', 'Martin', '1970-12-31 00:00:00', 2.02);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('05885114Q', 'Luis Miguel', 'Fernandez', '1970-12-31 00:00:00', 1.89);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('35492852T', 'Luis', 'Escolar', '1970-12-31 00:00:00', 1.95);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('45696683S', 'Alirio', 'Suarez', '1990-12-31 00:00:00', 1.93);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('02322522A', 'Alejandro', 'Jimenez', '1991-12-31 00:00:00', 1.98);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('14145856W', 'Mariano', 'Cordero', '1993-12-31 00:00:00', 1.90);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('38558650W', 'Marcelo', 'Camero', '1995-12-31 00:00:00', 1.91);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('25885116Q', 'Carmelo', 'de Luca', '1990-12-31 00:00:00', 1.96);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('45492851T', 'Carlos', 'Zambrano', '1991-12-31 00:00:00', 1.95);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('45412859T', 'Luis', 'Sosa', '1992-12-31 00:00:00', 1.97);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('45492655T', 'Jose Manuel', 'Herrera', '1993-12-31 00:00:00', 1.94);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('45432811Q', 'Luis Manuel', 'Villegas', '1994-12-31 00:00:00', 1.92);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('15432811R', 'Jaime', 'Sánchez', '1992-10-11 00:00:00', 1.90);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('25432855K', 'Mario', 'Rodríguez', '1993-15-31 00:00:00', 1.93);
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nto, altura)
VALUES ('35432899X', 'Daniel', 'López', '1994-09-30 00:00:00', 1.92);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [80]:
%sql SELECT * FROM Jugadores

Done.

[(u'15696688S', u'Miguel', u'Sanchez', u'1970-12-31 00:00:00', 1.98),
 (u'42322521A', u'Cristian', u'Lopez', u'1970-12-31 00:00:00', 1.92),
 (u'24145854W', u'Alfredo', u'Landa', u'1970-12-31 00:00:00', 1.95),
 (u'78558651W', u'Antonio', u'Martin', u'1970-12-31 00:00:00', 2.02),
 (u'05885114Q', u'Luis Miguel', u'Fernandez', u'1970-12-31 00:00:00', 1.89),
 (u'35492852T', u'Luis', u'Escolar', u'1970-12-31 00:00:00', 1.95),
 (u'45696683S', u'Alirio', u'Suarez', u'1990-12-31 00:00:00', 1.93),
 (u'02322522A', u'Alejandro', u'Jimenez', u'1991-12-31 00:00:00', 1.98),
 (u'14145856W', u'Mariano', u'Cordero', u'1993-12-31 00:00:00', 1.9),
 (u'38558650W', u'Marcelo', u'Camero', u'1995-12-31 00:00:00', 1.91),
 (u'25885116Q', u'Carmelo', u'de Luca', u'1990-12-31 00:00:00', 1.96),
 (u'45492851T', u'Carlos', u'Zambrano', u'1991-12-31 00:00:00', 1.95),
 (u'45412859T', u'Luis', u'Sosa', u'1992-12-31 00:00:00', 1.97),
 (u'45492655T', u'Jose Manuel', u'Herrera', u'1993-12-31 00:00:00', 1.94),
 (u'45432811Q', u'Luis Manuel', u'Villegas', u'1994-12-31 00:00:00', 1.92),
 (u'15432811R', u'Jaime', u'S\xe1nchez', u'1992-10-11 00:00:00', 1.9),
 (u'25432855K', u'Mario', u'Rodr\xedguez', u'1993-15-31 00:00:00', 1.93),
 (u'35432899X', u'Daniel', u'L\xf3pez', u'1994-09-30 00:00:00', 1.92)]

# TEMPORADAS

In [100]:
%%sql
CREATE TABLE IF NOT EXISTS Temporadas
(numero INT,
 fecha_ini DATETIME,
 fecha_fin DATETIME,
 patrocinada_por VARCHAR(10),
 PRIMARY KEY (numero),
 FOREIGN KEY (patrocinada_por) REFERENCES Empresas(cif)
);

Done.
Done.

[]

In [101]:
%%sql
DELETE FROM Temporadas;
SELECT * FROM Temporadas

0 rows affected.
Done.

[]

In [102]:
%%sql
INSERT INTO Temporadas(numero, fecha_ini, fecha_fin, patrocinada_por)
VALUES (1, '2013-01-01 00:00:00', '2013-12-31 00:00:00', 'B41458540');
INSERT INTO Temporadas(numero, fecha_ini, fecha_fin, patrocinada_por)
VALUES (2, '2014-01-01 00:00:00', '2014-12-31 00:00:00', 'B85586510');
INSERT INTO Temporadas(numero, fecha_ini, fecha_fin, patrocinada_por)
VALUES (3, '2015-01-01 00:00:00', '2015-12-31 00:00:00', 'B23225210');
INSERT INTO Temporadas(numero, fecha_ini, fecha_fin, patrocinada_por)
VALUES (4, '2016-01-01 00:00:00', '2016-12-31 00:00:00', 'B56966880');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [103]:
%sql SELECT * FROM Temporadas

Done.

[(1, u'2013-01-01 00:00:00', u'2013-12-31 00:00:00', u'B41458540'),
 (2, u'2014-01-01 00:00:00', u'2014-12-31 00:00:00', u'B85586510'),
 (3, u'2015-01-01 00:00:00', u'2015-12-31 00:00:00', u'B23225210'),
 (4, u'2016-01-01 00:00:00', u'2016-12-31 00:00:00', u'B56966880')]

# PARTICIPAN_ENTRENADORES

En este caso, al imponerse la restricción "Un entrenador no puede entrenar a más de un equipo en una temporada", he decidido implementarlo obligando a que un entrenador asociado a una temporada no pueda aparecer más de una vez en la relación entre Entrenadores/Equipos/Temporadas. Esto implica que un entrenador tampoco podrá, una vez entrenado a un equipo y tras ser reemplazado por otro entrenador, volver a entrenar a ese ni a ningún equipo dentro de esa misma temporada.

Por otra parte, también hay que incluir la ciudad y la comunidad autónoma a la que pertenece el equipo, porque al poder haber dos equipos con el mismo nombre en distintas ciudades y dos ciudades con el mismo nombre en distintas comunidades autónomas, si sólo pusiéramos el nombre no sería posible recuperar la información de la ciudad y la com. autónoma a la que pertence.

In [7]:
%%sql
CREATE TABLE IF NOT EXISTS Participan_Entrenadores
(entrenador VARCHAR(10),
 equipo VARCHAR(30),
 ciudad VARCHAR(30),
 com_autonoma VARCHAR(30),
 temporada INT,
 fecha_ini DATETIME,
 fecha_fin DATETIME,
 PRIMARY KEY (entrenador, equipo, ciudad, com_autonoma, temporada),
 FOREIGN KEY (entrenador) REFERENCES Entrenadores(nif),
 FOREIGN KEY (equipo) REFERENCES Equipos(nombre),
 FOREIGN KEY (ciudad) REFERENCES Ciudades(nombre),
 FOREIGN KEY (com_autonoma) REFERENCES Comunidades_Autonomas(nombre),
 FOREIGN KEY (temporada) REFERENCES Temporadas(numero),
 UNIQUE(entrenador, temporada)
);

Done.
Done.

[]

In [8]:
%%sql
DELETE FROM Participan_Entrenadores;
SELECT * FROM Participan_Entrenadores

0 rows affected.
Done.

[]

In [9]:
%%sql
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('58963633N', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 1, '2013-01-01 00:00:00', '2013-06-30 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('85967585L', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 1, '2013-07-01 00:00:00', '2013-12-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('02589658J', 'CB Sevilla', 'Sevilla', 'Andalucia', 1, '2013-01-01 00:00:00', '2013-12-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('63272983D', 'CB Pontevedra', 'Pontevedra', 'Galicia', 1, '2013-01-01 00:00:00', '2013-12-31 00:00:00');

INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('63272983D', 'CB Estudiantes', 'Vigo', 'Galicia', 2, '2014-01-01 00:00:00', '2014-12-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('18992232H', 'CB Cordoba', 'Cordoba', 'Andalucia', 2, '2014-01-01 00:00:00', '2014-12-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('47787543G', 'CB Girona', 'Girona', 'Cataluña', 2, '2014-01-01 00:00:00', '2014-03-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('09099154Y', 'CB Girona', 'Girona', 'Cataluña', 2, '2014-04-01 00:00:00', '2014-12-31 00:00:00');

INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('55225589F', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 3, '2015-01-01 00:00:00', '2015-12-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('57656799A', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 3, '2015-01-01 00:00:00', '2015-12-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('47787543G', 'CB Pontevedra', 'Pontevedra', 'Galicia', 3, '2015-01-01 00:00:00', '2015-12-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('09099154Y', 'CB Pontevedra','Pontevedra', 'Galicia', 3, '2015-01-01 00:00:00', '2015-12-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('58963633N', 'CB Mostoles','Mostoles', 'Madrid', 3, '2015-01-01 00:00:00', '2015-12-31 00:00:00');

INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('58963633N', 'CB Mostoles', 'Mostoles', 'Madrid', 4, '2016-01-01 00:00:00', '2016-12-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('02589658J', 'CB Cordoba','Cordoba', 'Andalucia', 4, '2016-01-01 00:00:00', '2016-12-31 00:00:00');
INSERT INTO Participan_Entrenadores(entrenador, equipo, ciudad, com_autonoma, temporada, fecha_ini, fecha_fin)
VALUES ('47787543G', 'CB Girona','Girona', 'Cataluña', 4, '2016-01-01 00:00:00', '2016-12-31 00:00:00');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%sql SELECT * FROM Participan_Entrenadores

Done.

[(u'58963633N', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 1, u'2013-01-01 00:00:00', u'2013-06-30 00:00:00'),
 (u'85967585L', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 1, u'2013-07-01 00:00:00', u'2013-12-31 00:00:00'),
 (u'02589658J', u'CB Sevilla', u'Sevilla', u'Andalucia', 1, u'2013-01-01 00:00:00', u'2013-12-31 00:00:00'),
 (u'63272983D', u'CB Pontevedra', u'Pontevedra', u'Galicia', 1, u'2013-01-01 00:00:00', u'2013-12-31 00:00:00'),
 (u'63272983D', u'CB Estudiantes', u'Vigo', u'Galicia', 2, u'2014-01-01 00:00:00', u'2014-12-31 00:00:00'),
 (u'18992232H', u'CB Cordoba', u'Cordoba', u'Andalucia', 2, u'2014-01-01 00:00:00', u'2014-12-31 00:00:00'),
 (u'47787543G', u'CB Girona', u'Girona', u'Catalu\xf1a', 2, u'2014-01-01 00:00:00', u'2014-03-31 00:00:00'),
 (u'09099154Y', u'CB Girona', u'Girona', u'Catalu\xf1a', 2, u'2014-04-01 00:00:00', u'2014-12-31 00:00:00'),
 (u'55225589F', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 3, u'2015-01-01 00:00:00', u'2015-12-31 00:00:00'),
 (u'57656799A', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 3, u'2015-01-01 00:00:00', u'2015-12-31 00:00:00'),
 (u'47787543G', u'CB Pontevedra', u'Pontevedra', u'Galicia', 3, u'2015-01-01 00:00:00', u'2015-12-31 00:00:00'),
 (u'09099154Y', u'CB Pontevedra', u'Pontevedra', u'Galicia', 3, u'2015-01-01 00:00:00', u'2015-12-31 00:00:00'),
 (u'58963633N', u'CB Mostoles', u'Mostoles', u'Madrid', 3, u'2015-01-01 00:00:00', u'2015-12-31 00:00:00'),
 (u'58963633N', u'CB Mostoles', u'Mostoles', u'Madrid', 4, u'2016-01-01 00:00:00', u'2016-12-31 00:00:00'),
 (u'02589658J', u'CB Cordoba', u'Cordoba', u'Andalucia', 4, u'2016-01-01 00:00:00', u'2016-12-31 00:00:00'),
 (u'47787543G', u'CB Girona', u'Girona', u'Catalu\xf1a', 4, u'2016-01-01 00:00:00', u'2016-12-31 00:00:00')]

# PARTICIPAN_JUGADORES

Esto sería lo equivalente a la plantilla del equipo.

En este caso, al imponerse la restricción "Los jugadores no cambian de equipo dentro de la misma temporada", he decidido implementarlo obligando a que un jugador asociado a una temporada no pueda aparecer más de una vez en la relación entre Jugadores/Equipos/Temporadas. Esto implica que un jugador tampoco podrá, una vez participado en un equipo y tras ser expulsado, volver a formar parte de ese ni de ningún otro equipo dentro de esa misma temporada.

De nuevo los equipos van asociados a una ciudad asociada a una comunidad autónoma.

In [11]:
%%sql
CREATE TABLE IF NOT EXISTS Participan_Jugadores
(jugador VARCHAR(10),
 equipo VARCHAR(30),
 ciudad VARCHAR(30),
 com_autonoma VARCHAR(30),
 temporada INT,
 PRIMARY KEY (jugador, equipo, ciudad, com_autonoma, temporada),
 FOREIGN KEY (jugador) REFERENCES Jugadores(nif),
 FOREIGN KEY (equipo) REFERENCES Equipos(nombre),
 FOREIGN KEY (ciudad) REFERENCES Ciudades(nombre),
 FOREIGN KEY (com_autonoma) REFERENCES Comunidades_Autonomas(nombre),
 FOREIGN KEY (temporada) REFERENCES Temporadas(numero),
 UNIQUE(jugador, temporada)
);

Done.
Done.

[]

In [81]:
%%sql
DELETE FROM Participan_Jugadores;
SELECT * FROM Participan_Jugadores

60 rows affected.
Done.

[]

In [82]:
%%sql
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('15696688S', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('42322521A', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('24145854W', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('78558651W', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('05885114Q', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('15432811R', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('35492852T', 'CB Sevilla', 'Sevilla', 'Andalucia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45696683S', 'CB Sevilla', 'Sevilla', 'Andalucia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('02322522A', 'CB Sevilla', 'Sevilla', 'Andalucia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('14145856W', 'CB Sevilla', 'Sevilla', 'Andalucia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('38558650W', 'CB Sevilla', 'Sevilla', 'Andalucia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('25432855K', 'CB Sevilla', 'Sevilla', 'Andalucia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('25885116Q', 'CB Pontevedra', 'Pontevedra', 'Galicia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45492851T', 'CB Pontevedra', 'Pontevedra', 'Galicia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45412859T', 'CB Pontevedra', 'Pontevedra', 'Galicia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45492655T', 'CB Pontevedra', 'Pontevedra', 'Galicia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45432859T', 'CB Pontevedra', 'Pontevedra', 'Galicia', 1);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('35432899X', 'CB Pontevedra', 'Pontevedra', 'Galicia', 1);

INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('15696688S', 'CB Estudiantes', 'Vigo', 'Galicia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('42322521A', 'CB Estudiantes', 'Vigo', 'Galicia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('24145854W', 'CB Estudiantes', 'Vigo', 'Galicia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('78558651W', 'CB Estudiantes', 'Vigo', 'Galicia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('05885114Q', 'CB Estudiantes', 'Vigo', 'Galicia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('15432811R', 'CB Estudiantes', 'Vigo', 'Galicia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('35492852T', 'CB Cordoba', 'Cordoba', 'Andalucia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45696683S', 'CB Cordoba', 'Cordoba', 'Andalucia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('02322522A', 'CB Cordoba', 'Cordoba', 'Andalucia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('14145856W', 'CB Cordoba', 'Cordoba', 'Andalucia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('38558650W', 'CB Cordoba', 'Cordoba', 'Andalucia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('25432855K', 'CB Cordoba', 'Cordoba', 'Andalucia', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('25885116Q', 'CB Girona', 'Girona', 'Cataluña', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45492851T', 'CB Girona', 'Girona', 'Cataluña', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45412859T', 'CB Girona', 'Girona', 'Cataluña', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45492655T', 'CB Girona', 'Girona', 'Cataluña', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45432859T', 'CB Girona', 'Girona', 'Cataluña', 2);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('35432899X', 'CB Girona', 'Girona', 'Cataluña', 2);

INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('15696688S', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('42322521A', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('24145854W', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('78558651W', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('05885114Q', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('15432811R', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('35492852T', 'CB Pontevedra', 'Pontevedra', 'Galicia', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45696683S', 'CB Pontevedra', 'Pontevedra', 'Galicia', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('02322522A', 'CB Pontevedra', 'Pontevedra', 'Galicia', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('14145856W', 'CB Pontevedra', 'Pontevedra', 'Galicia', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('38558650W', 'CB Pontevedra', 'Pontevedra', 'Galicia', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('25432855K', 'CB Pontevedra', 'Pontevedra', 'Galicia', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('25885116Q', 'CB Mostoles','Mostoles', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45492851T', 'CB Mostoles','Mostoles', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45412859T', 'CB Mostoles','Mostoles', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45492655T', 'CB Mostoles','Mostoles', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45432859T', 'CB Mostoles','Mostoles', 'Madrid', 3);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('35432899X', 'CB Mostoles','Mostoles', 'Madrid', 3);

INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('15696688S', 'CB Mostoles', 'Mostoles', 'Madrid', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('42322521A', 'CB Mostoles', 'Mostoles', 'Madrid', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('24145854W', 'CB Mostoles', 'Mostoles', 'Madrid', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('78558651W', 'CB Mostoles', 'Mostoles', 'Madrid', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('05885114Q', 'CB Mostoles', 'Mostoles', 'Madrid', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('15432811R', 'CB Mostoles', 'Mostoles', 'Madrid', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('35492852T', 'CB Cordoba','Cordoba', 'Andalucia', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45696683S', 'CB Cordoba','Cordoba', 'Andalucia', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('02322522A', 'CB Cordoba','Cordoba', 'Andalucia', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('14145856W', 'CB Cordoba','Cordoba', 'Andalucia', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('38558650W', 'CB Cordoba','Cordoba', 'Andalucia', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('25432855K', 'CB Cordoba','Cordoba', 'Andalucia', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('25885116Q', 'CB Girona','Girona', 'Cataluña', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45492851T', 'CB Girona','Girona', 'Cataluña', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45412859T', 'CB Girona','Girona', 'Cataluña', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45492655T', 'CB Girona','Girona', 'Cataluña', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('45432859T', 'CB Girona','Girona', 'Cataluña', 4);
INSERT INTO Participan_Jugadores(jugador, equipo, ciudad, com_autonoma, temporada)
VALUES ('35432899X', 'CB Girona','Girona', 'Cataluña', 4);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [83]:
%sql SELECT * FROM Participan_Jugadores

Done.

[(u'15696688S', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 1),
 (u'42322521A', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 1),
 (u'24145854W', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 1),
 (u'78558651W', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 1),
 (u'05885114Q', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 1),
 (u'15432811R', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 1),
 (u'35492852T', u'CB Sevilla', u'Sevilla', u'Andalucia', 1),
 (u'45696683S', u'CB Sevilla', u'Sevilla', u'Andalucia', 1),
 (u'02322522A', u'CB Sevilla', u'Sevilla', u'Andalucia', 1),
 (u'14145856W', u'CB Sevilla', u'Sevilla', u'Andalucia', 1),
 (u'38558650W', u'CB Sevilla', u'Sevilla', u'Andalucia', 1),
 (u'25432855K', u'CB Sevilla', u'Sevilla', u'Andalucia', 1),
 (u'25885116Q', u'CB Pontevedra', u'Pontevedra', u'Galicia', 1),
 (u'45492851T', u'CB Pontevedra', u'Pontevedra', u'Galicia', 1),
 (u'45412859T', u'CB Pontevedra', u'Pontevedra', u'Galicia', 1),
 (u'45492655T', u'CB Pontevedra', u'Pontevedra', u'Galicia', 1),
 (u'45432859T', u'CB Pontevedra', u'Pontevedra', u'Galicia', 1),
 (u'35432899X', u'CB Pontevedra', u'Pontevedra', u'Galicia', 1),
 (u'15696688S', u'CB Estudiantes', u'Vigo', u'Galicia', 2),
 (u'42322521A', u'CB Estudiantes', u'Vigo', u'Galicia', 2),
 (u'24145854W', u'CB Estudiantes', u'Vigo', u'Galicia', 2),
 (u'78558651W', u'CB Estudiantes', u'Vigo', u'Galicia', 2),
 (u'05885114Q', u'CB Estudiantes', u'Vigo', u'Galicia', 2),
 (u'15432811R', u'CB Estudiantes', u'Vigo', u'Galicia', 2),
 (u'35492852T', u'CB Cordoba', u'Cordoba', u'Andalucia', 2),
 (u'45696683S', u'CB Cordoba', u'Cordoba', u'Andalucia', 2),
 (u'02322522A', u'CB Cordoba', u'Cordoba', u'Andalucia', 2),
 (u'14145856W', u'CB Cordoba', u'Cordoba', u'Andalucia', 2),
 (u'38558650W', u'CB Cordoba', u'Cordoba', u'Andalucia', 2),
 (u'25432855K', u'CB Cordoba', u'Cordoba', u'Andalucia', 2),
 (u'25885116Q', u'CB Girona', u'Girona', u'Catalu\xf1a', 2),
 (u'45492851T', u'CB Girona', u'Girona', u'Catalu\xf1a', 2),
 (u'45412859T', u'CB Girona', u'Girona', u'Catalu\xf1a', 2),
 (u'45492655T', u'CB Girona', u'Girona', u'Catalu\xf1a', 2),
 (u'45432859T', u'CB Girona', u'Girona', u'Catalu\xf1a', 2),
 (u'35432899X', u'CB Girona', u'Girona', u'Catalu\xf1a', 2),
 (u'15696688S', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 3),
 (u'42322521A', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 3),
 (u'24145854W', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 3),
 (u'78558651W', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 3),
 (u'05885114Q', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 3),
 (u'15432811R', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 3),
 (u'35492852T', u'CB Pontevedra', u'Pontevedra', u'Galicia', 3),
 (u'45696683S', u'CB Pontevedra', u'Pontevedra', u'Galicia', 3),
 (u'02322522A', u'CB Pontevedra', u'Pontevedra', u'Galicia', 3),
 (u'14145856W', u'CB Pontevedra', u'Pontevedra', u'Galicia', 3),
 (u'38558650W', u'CB Pontevedra', u'Pontevedra', u'Galicia', 3),
 (u'25432855K', u'CB Pontevedra', u'Pontevedra', u'Galicia', 3),
 (u'25885116Q', u'CB Mostoles', u'Mostoles', u'Madrid', 3),
 (u'45492851T', u'CB Mostoles', u'Mostoles', u'Madrid', 3),
 (u'45412859T', u'CB Mostoles', u'Mostoles', u'Madrid', 3),
 (u'45492655T', u'CB Mostoles', u'Mostoles', u'Madrid', 3),
 (u'45432859T', u'CB Mostoles', u'Mostoles', u'Madrid', 3),
 (u'35432899X', u'CB Mostoles', u'Mostoles', u'Madrid', 3),
 (u'15696688S', u'CB Mostoles', u'Mostoles', u'Madrid', 4),
 (u'42322521A', u'CB Mostoles', u'Mostoles', u'Madrid', 4),
 (u'24145854W', u'CB Mostoles', u'Mostoles', u'Madrid', 4),
 (u'78558651W', u'CB Mostoles', u'Mostoles', u'Madrid', 4),
 (u'05885114Q', u'CB Mostoles', u'Mostoles', u'Madrid', 4),
 (u'15432811R', u'CB Mostoles', u'Mostoles', u'Madrid', 4),
 (u'35492852T', u'CB Cordoba', u'Cordoba', u'Andalucia', 4),
 (u'45696683S', u'CB Cordoba', u'Cordoba', u'Andalucia', 4),
 (u'02322522A', u'CB Cordoba', u'Cordoba', u'Andalucia', 4),
 (u'14145856W', u'CB Cordoba', u'Cordoba', u'Andalucia', 4),
 (u'38558650W', u'CB Cordoba', u'Cordoba', u'Andalucia', 4),
 (u'25432855K', u'CB Cordoba', u'Cordoba', u'Andalucia', 4),
 (u'25885116Q', u'CB Girona', u'Girona', u'Catalu\xf1a', 4),
 (u'45492851T', u'CB Girona', u'Girona', u'Catalu\xf1a', 4),
 (u'45412859T', u'CB Girona', u'Girona', u'Catalu\xf1a', 4),
 (u'45492655T', u'CB Girona', u'Girona', u'Catalu\xf1a', 4),
 (u'45432859T', u'CB Girona', u'Girona', u'Catalu\xf1a', 4),
 (u'35432899X', u'CB Girona', u'Girona', u'Catalu\xf1a', 4)]

# DIRECCIONES

En este caso he supuesto que es improbable que aunque haya la misma calle en dos ciudades también coincida en el número en el que está localizada la cancha, por lo que es suficiente considerar como clave la calle y el número.

In [74]:
%%sql
CREATE TABLE IF NOT EXISTS Direcciones
(calle VARCHAR(30),
 numero INT,
 ciudad VARCHAR(30),
 com_autonoma VARCHAR(30),
 PRIMARY KEY (calle, numero),
 FOREIGN KEY (ciudad) REFERENCES Ciudades(nombre),
 FOREIGN KEY (com_autonoma) REFERENCES Comunidades_Autonomas(nombre)
);

Done.

[]

In [86]:
%%sql
DELETE FROM Direcciones;
SELECT * FROM Direcciones

9 rows affected.
Done.

[]

In [87]:
%%sql
INSERT INTO Direcciones(calle, numero, ciudad, com_autonoma)
VALUES ('Calle Peonia', 24, 'Fuenlabrada', 'Madrid');
INSERT INTO Direcciones(calle, numero, ciudad, com_autonoma)
VALUES ('Calle Velazquez', 12, 'Fuenlabrada', 'Madrid');
INSERT INTO Direcciones(calle, numero, ciudad, com_autonoma)
VALUES ('Calle Filipinas', 45, 'Mostoles', 'Madrid');
INSERT INTO Direcciones(calle, numero, ciudad, com_autonoma)
VALUES ('Calle Arguelles', 1, 'Alcorcon', 'Madrid');
INSERT INTO Direcciones(calle, numero, ciudad, com_autonoma)
VALUES ('Plaza Minarete', 5, 'Sevilla', 'Andalucia');
INSERT INTO Direcciones(calle, numero, ciudad, com_autonoma)
VALUES ('Calle de la Cruz', 4, 'Cordoba', 'Andalucia');
INSERT INTO Direcciones(calle, numero, ciudad, com_autonoma)
VALUES ('Calle Relacion', 12, 'Vigo', 'Galicia');
INSERT INTO Direcciones(calle, numero, ciudad, com_autonoma)
VALUES ('Avenida de la Paz', 8, 'Pontevedra', 'Galicia');
INSERT INTO Direcciones(calle, numero, ciudad, com_autonoma)
VALUES ('Calle Amistad', 7, 'Barcelona', 'Cataluña');
INSERT INTO Direcciones(calle, numero, ciudad, com_autonoma)
VALUES ('Calle Lirios', 33, 'Girona', 'Cataluña');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [88]:
%sql SELECT * FROM Direcciones

Done.

[(u'Calle Peonia', 24, u'Fuenlabrada', u'Madrid'),
 (u'Calle Velazquez', 12, u'Fuenlabrada', u'Madrid'),
 (u'Calle Filipinas', 45, u'Mostoles', u'Madrid'),
 (u'Calle Arguelles', 1, u'Alcorcon', u'Madrid'),
 (u'Plaza Minarete', 5, u'Sevilla', u'Andalucia'),
 (u'Calle de la Cruz', 4, u'Cordoba', u'Andalucia'),
 (u'Calle Relacion', 12, u'Vigo', u'Galicia'),
 (u'Avenida de la Paz', 8, u'Pontevedra', u'Galicia'),
 (u'Calle Amistad', 7, u'Barcelona', u'Catalu\xf1a'),
 (u'Calle Lirios', 33, u'Girona', u'Catalu\xf1a')]

# CANCHAS

Al fijar como clave primaria tan sólo el nombre de cancha permito que haya dos canchas en la misma dirección, ya que pueden estar juntas la una a la otra (por ejemplo en el mismo polideportivo).

In [38]:
%%sql
CREATE TABLE IF NOT EXISTS Canchas
(nombre VARCHAR(30),
 calle VARCHAR(30),
 numero INT,
 PRIMARY KEY (nombre)
 FOREIGN KEY (calle, numero) REFERENCES Direcciones(calle, numero)
);

Done.
Done.

[]

In [39]:
%%sql
DELETE FROM Canchas;
SELECT * FROM Canchas

0 rows affected.
Done.

[]

In [40]:
%%sql
INSERT INTO Canchas(nombre, calle, numero)
VALUES ('F1', 'Calle Peonia', 24);
INSERT INTO Canchas(nombre, calle, numero)
VALUES ('F2', 'Calle Velazquez', 12);
INSERT INTO Canchas(nombre, calle, numero)
VALUES ('M1', 'Calle Filipinas', 45);
INSERT INTO Canchas(nombre, calle, numero)
VALUES ('A1', 'Calle Arguelles', 1);
INSERT INTO Canchas(nombre, calle, numero)
VALUES ('S1', 'Plaza Minarete', 5);
INSERT INTO Canchas(nombre, calle, numero)
VALUES ('C1', 'Calle de la Cruz', 4);
INSERT INTO Canchas(nombre, calle, numero)
VALUES ('V1', 'Calle Relacion', 12);
INSERT INTO Canchas(nombre, calle, numero)
VALUES ('P1', 'Avenida de la Paz', 8);
INSERT INTO Canchas(nombre, calle, numero)
VALUES ('B1', 'Calle Amistad', 7);
INSERT INTO Canchas(nombre, calle, numero)
VALUES ('G1', 'Calle Lirios', 33);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [41]:
%sql SELECT * FROM Canchas

Done.

[(u'F1', u'Calle Peonia', 24),
 (u'F2', u'Calle Velazquez', 12),
 (u'M1', u'Calle Filipinas', 45),
 (u'A1', u'Calle Arguelles', 1),
 (u'S1', u'Plaza Minarete', 5),
 (u'C1', u'Calle de la Cruz', 4),
 (u'V1', u'Calle Relacion', 12),
 (u'P1', u'Avenida de la Paz', 8),
 (u'B1', u'Calle Amistad', 7),
 (u'G1', u'Calle Lirios', 33)]

# EMPRESAS

In [93]:
%%sql
CREATE TABLE IF NOT EXISTS Empresas
(cif VARCHAR(10),
 nombre VARCHAR (30),
 PRIMARY KEY (cif)
);

Done.

[]

In [94]:
%%sql
DELETE FROM Empresas;
SELECT * FROM Empresas

0 rows affected.
Done.

[]

In [95]:
%%sql
INSERT INTO Empresas(cif, nombre)
VALUES ('B56966880', 'AVG S.L.');
INSERT INTO Empresas(cif, nombre)
VALUES ('B23225210', 'Deptris S.A.');
INSERT INTO Empresas(cif, nombre)
VALUES ('B41458540', 'BasketSports S.L.');
INSERT INTO Empresas(cif, nombre)
VALUES ('B85586510', 'HealthLife S.L.');
INSERT INTO Empresas(cif, nombre)
VALUES ('B58851140', 'SixSports S.A.');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

# PATROCINADOS_POR

No puede haber una empresa que no patrocine a algún equipo

In [42]:
%%sql
CREATE TABLE IF NOT EXISTS Patrocinados_Por
(equipo VARCHAR(30),
 ciudad VARCHAR(30),
 com_autonoma VARCHAR(30),
 empresa_patrocinadora VARCHAR(30),
 PRIMARY KEY (equipo, ciudad, com_autonoma, empresa_patrocinadora),
 FOREIGN KEY (equipo) REFERENCES Equipos(nombre),
 FOREIGN KEY (ciudad) REFERENCES Ciudades(nombre),
 FOREIGN KEY (com_autonoma) REFERENCES Comunidades_Autonomas(nombre),
 FOREIGN KEY (empresa_patrocinadora) REFERENCES Empresas(cif)
);

Done.
Done.

[]

In [43]:
%%sql
DELETE FROM Patrocinados_Por;
SELECT * FROM Patrocinados_Por

0 rows affected.
Done.

[]

In [44]:
%%sql
INSERT INTO Patrocinados_Por(equipo, ciudad, com_autonoma, empresa_patrocinadora)
VALUES ('CB Fuenla', 'Fuenlabrada', 'Madrid', 'B56966880');
INSERT INTO Patrocinados_Por(equipo, ciudad, com_autonoma, empresa_patrocinadora)
VALUES ('CB Mostoles', 'Mostoles', 'Madrid', 'B85586510');
INSERT INTO Patrocinados_Por(equipo, ciudad, com_autonoma, empresa_patrocinadora)
VALUES ('CB Alcorcon', 'Alcorcon', 'Madrid', 'B23225210');
INSERT INTO Patrocinados_Por(equipo, ciudad, com_autonoma, empresa_patrocinadora)
VALUES ('CB Sevilla', 'Sevilla', 'Andalucia', 'B58851140');
INSERT INTO Patrocinados_Por(equipo, ciudad, com_autonoma, empresa_patrocinadora)
VALUES ('CB Estudiantes', 'Vigo', 'Galicia', 'B56966880');
INSERT INTO Patrocinados_Por(equipo, ciudad, com_autonoma, empresa_patrocinadora)
VALUES ('CB Pontevedra', 'Pontevedra', 'Galicia', 'B41458540');
INSERT INTO Patrocinados_Por(equipo, ciudad, com_autonoma, empresa_patrocinadora)
VALUES ('CB Estudiantes', 'Barcelona', 'Cataluña', 'B85586510');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [45]:
%sql SELECT * FROM Patrocinados_Por

Done.

[(u'CB Fuenla', u'Fuenlabrada', u'Madrid', u'B56966880'),
 (u'CB Mostoles', u'Mostoles', u'Madrid', u'B85586510'),
 (u'CB Alcorcon', u'Alcorcon', u'Madrid', u'B23225210'),
 (u'CB Sevilla', u'Sevilla', u'Andalucia', u'B58851140'),
 (u'CB Estudiantes', u'Vigo', u'Galicia', u'B56966880'),
 (u'CB Pontevedra', u'Pontevedra', u'Galicia', u'B41458540'),
 (u'CB Estudiantes', u'Barcelona', u'Catalu\xf1a', u'B85586510')]

# ENTRENAN

In [46]:
%%sql
CREATE TABLE IF NOT EXISTS Entrenan
(entrenador VARCHAR(10),
 equipo VARCHAR(30), 
 ciudad VARCHAR(30),
 com_autonoma VARCHAR(30),
 temporada INT,
 cancha VARCHAR(30),
 PRIMARY KEY (equipo, ciudad, com_autonoma, entrenador, temporada, cancha),
 FOREIGN KEY (equipo) REFERENCES Equipos(nombre),
 FOREIGN KEY (ciudad) REFERENCES Ciudades(nombre),
 FOREIGN KEY (com_autonoma) REFERENCES Comunidades_Autonomas(nombre),
 FOREIGN KEY (entrenador) REFERENCES Entrenadores(nif),
 FOREIGN KEY (temporada) REFERENCES Temporadas(numero)
 FOREIGN KEY (cancha) REFERENCES Canchas(nombre)
);

Done.
Done.

[]

In [49]:
%%sql
DELETE FROM Entrenan;
SELECT * FROM Entrenan

2 rows affected.
Done.

[]

In [50]:
%%sql
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('58963633N', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 1, 'F1');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('85967585L', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 1, 'F2');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('02589658J', 'CB Sevilla', 'Sevilla', 'Andalucia', 1, 'S1');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('63272983D', 'CB Pontevedra', 'Pontevedra', 'Galicia', 1, 'P1');

INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('63272983D', 'CB Estudiantes', 'Vigo', 'Galicia', 2, 'V1');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('18992232H', 'CB Cordoba', 'Cordoba', 'Andalucia', 2, 'C1');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('47787543G', 'CB Girona', 'Girona', 'Cataluña', 2, 'G1');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('09099154Y', 'CB Girona', 'Girona', 'Cataluña', 2, 'G1');

INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('55225589F', 'CB Fuenla', 'Fuenlabrada','Madrid', 3, 'F1');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('57656799A', 'CB Fuenla', 'Fuenlabrada', 'Madrid', 3, 'F2');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('47787543G', 'CB Pontevedra', 'Pontevedra', 'Galicia', 3, 'P1');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('09099154Y', 'CB Pontevedra','Pontevedra', 'Galicia', 3, 'P1');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('58963633N', 'CB Mostoles','Mostoles', 'Madrid', 3, 'M1');

INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('58963633N', 'CB Mostoles', 'Mostoles', 'Madrid', 4, 'M1');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('02589658J', 'CB Cordoba','Cordoba', 'Andalucia', 4, 'C1');
INSERT INTO Entrenan(entrenador, equipo, ciudad, com_autonoma, temporada, cancha)
VALUES ('47787543G', 'CB Girona','Girona', 'Cataluña', 4, 'G1');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [51]:
%sql SELECT * FROM Entrenan

Done.

[(u'58963633N', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 1, u'F1'),
 (u'85967585L', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 1, u'F2'),
 (u'02589658J', u'CB Sevilla', u'Sevilla', u'Andalucia', 1, u'S1'),
 (u'63272983D', u'CB Pontevedra', u'Pontevedra', u'Galicia', 1, u'P1'),
 (u'63272983D', u'CB Estudiantes', u'Vigo', u'Galicia', 2, u'V1'),
 (u'18992232H', u'CB Cordoba', u'Cordoba', u'Andalucia', 2, u'C1'),
 (u'47787543G', u'CB Girona', u'Girona', u'Catalu\xf1a', 2, u'G1'),
 (u'09099154Y', u'CB Girona', u'Girona', u'Catalu\xf1a', 2, u'G1'),
 (u'55225589F', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 3, u'F1'),
 (u'57656799A', u'CB Fuenla', u'Fuenlabrada', u'Madrid', 3, u'F2'),
 (u'47787543G', u'CB Pontevedra', u'Pontevedra', u'Galicia', 3, u'P1'),
 (u'09099154Y', u'CB Pontevedra', u'Pontevedra', u'Galicia', 3, u'P1'),
 (u'58963633N', u'CB Mostoles', u'Mostoles', u'Madrid', 3, u'M1'),
 (u'58963633N', u'CB Mostoles', u'Mostoles', u'Madrid', 4, u'M1'),
 (u'02589658J', u'CB Cordoba', u'Cordoba', u'Andalucia', 4, u'C1'),
 (u'47787543G', u'CB Girona', u'Girona', u'Catalu\xf1a', 4, u'G1')]

# PARTIDOS
EL campo 'ident' lo añado para poder referirme desde otra tabla a un partido en particular. Ya que no lo incluyo en la Primary Key (pues esta la uso para no repetir los datos de un partido ya que un partido entre dos equipos el mismo día a la misma hora en la misma temporada no se pueden dar dos veces), lo hago UNIQUE para que no se repita.

Por otra parte no queremos que se dé la posibilidad de que un equipo forme parte de dos partidos el mismo día a la misma hora, para eso utilizo los dos UNIQUE restantes.

In [70]:
%%sql
CREATE TABLE IF NOT EXISTS Partidos
(ident VARCHAR(10),
 cancha VARCHAR(30),
 temporada INT,
 equipo1 VARCHAR(30),
 ciudad1 VARCHAR(30),
 com_autonoma1 VARCHAR(30),
 equipo2 VARCHAR(30),
 ciudad2 VARCHAR(30),
 com_autonoma2 VARCHAR(30),
 hora_ini DATETIME,
 hora_fin DATETIME,
 PRIMARY KEY (equipo1, ciudad1, com_autonoma1, equipo2, ciudad2, com_autonoma2, temporada, cancha, hora_ini),
 FOREIGN KEY (cancha) REFERENCES Canchas(nombre),
 FOREIGN KEY (equipo1) REFERENCES Equipos(nombre),
 FOREIGN KEY (ciudad1) REFERENCES Ciudades(nombre),
 FOREIGN KEY (com_autonoma1) REFERENCES Comunidades_Autonomas(nombre),
 FOREIGN KEY (equipo2) REFERENCES Equipos(nombre),
 FOREIGN KEY (ciudad2) REFERENCES Ciudades(nombre),
 FOREIGN KEY (com_autonoma2) REFERENCES Comunidades_Autonomas(nombre),
 FOREIGN KEY (temporada) REFERENCES Temporadas(numero),
 UNIQUE(equipo1, ciudad1, com_autonoma1, hora_ini),
 UNIQUE(equipo2, ciudad2, com_autonoma2, hora_ini)
 UNIQUE(ident)
);

Done.
Done.

[]

In [74]:
%%sql
DELETE FROM Partidos;
SELECT * FROM Partidos

8 rows affected.
Done.

[]

In [75]:
%%sql
INSERT INTO Partidos(ident, cancha, temporada, equipo1, ciudad1, com_autonoma1, equipo2, ciudad2, com_autonoma2, hora_ini, hora_fin)
VALUES ('P1T1', 'F1', 1, 'CB Fuenla', 'Fuenlabrada', 'Madrid', 'CB Sevilla', 'Sevilla', 'Andalucia', '2013-03-01 09:00:00', '2013-03-01 10:40:00');
INSERT INTO Partidos(ident, cancha, temporada, equipo1, ciudad1, com_autonoma1, equipo2, ciudad2, com_autonoma2, hora_ini, hora_fin)
VALUES ('P2T1', 'S1', 1, 'CB Sevilla', 'Sevilla', 'Andalucia', 'CB Pontevedra', 'Pontevedra', 'Galicia', '2013-09-01 09:00:00', '2013-09-01 10:40:00');

INSERT INTO Partidos(ident, cancha, temporada, equipo1, ciudad1, com_autonoma1, equipo2, ciudad2, com_autonoma2, hora_ini, hora_fin)
VALUES ('P1T2', 'V1', 2, 'CB Estudiantes', 'Vigo', 'Galicia', 'CB Girona', 'Girona', 'Cataluña', '2014-03-01 09:00:00', '2014-03-01 10:40:00');
INSERT INTO Partidos(ident, cancha, temporada, equipo1, ciudad1, com_autonoma1, equipo2, ciudad2, com_autonoma2, hora_ini, hora_fin)
VALUES ('P2T2', 'G1', 2, 'CB Girona', 'Girona', 'Cataluña', 'CB Estudiantes', 'Vigo', 'Galicia', '2014-09-01 09:00:00', '2014-09-01 10:40:00');

INSERT INTO Partidos(ident, cancha, temporada, equipo1, ciudad1, com_autonoma1, equipo2, ciudad2, com_autonoma2, hora_ini, hora_fin)
VALUES ('P1T3','M1', 3, 'CB Mostoles','Mostoles', 'Madrid', 'CB Pontevedra', 'Pontevedra', 'Galicia', '2015-03-01 09:00:00', '2015-03-01 10:40:00');
INSERT INTO Partidos(ident, cancha, temporada, equipo1, ciudad1, com_autonoma1, equipo2, ciudad2, com_autonoma2, hora_ini, hora_fin)
VALUES ('P2T3','F1', 3,  'CB Fuenla', 'Fuenlabrada','Madrid', 'CB Mostoles','Mostoles', 'Madrid', '2015-09-01 09:00:00', '2015-09-01 10:40:00');

INSERT INTO Partidos(ident, cancha, temporada, equipo1, ciudad1, com_autonoma1, equipo2, ciudad2, com_autonoma2, hora_ini, hora_fin)
VALUES ('P1T4','G1', 4, 'CB Girona','Girona', 'Cataluña', 'CB Mostoles', 'Mostoles', 'Madrid', '2016-03-01 09:00:00', '2016-03-01 10:40:00');
INSERT INTO Partidos(ident, cancha, temporada, equipo1, ciudad1, com_autonoma1, equipo2, ciudad2, com_autonoma2, hora_ini, hora_fin)
VALUES ('P2T4','M1', 4, 'CB Mostoles', 'Mostoles', 'Madrid', 'CB Cordoba','Cordoba', 'Andalucia', '2016-09-01 09:00:00', '2016-09-01 10:40:00');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [76]:
%sql SELECT * FROM Partidos

Done.

[(u'P1T1', u'F1', 1, u'CB Fuenla', u'Fuenlabrada', u'Madrid', u'CB Sevilla', u'Sevilla', u'Andalucia', u'2013-03-01 09:00:00', u'2013-03-01 10:40:00'),
 (u'P2T1', u'S1', 1, u'CB Sevilla', u'Sevilla', u'Andalucia', u'CB Pontevedra', u'Pontevedra', u'Galicia', u'2013-09-01 09:00:00', u'2013-09-01 10:40:00'),
 (u'P1T2', u'V1', 2, u'CB Estudiantes', u'Vigo', u'Galicia', u'CB Girona', u'Girona', u'Catalu\xf1a', u'2014-03-01 09:00:00', u'2014-03-01 10:40:00'),
 (u'P2T2', u'G1', 2, u'CB Girona', u'Girona', u'Catalu\xf1a', u'CB Estudiantes', u'Vigo', u'Galicia', u'2014-09-01 09:00:00', u'2014-09-01 10:40:00'),
 (u'P1T3', u'M1', 3, u'CB Mostoles', u'Mostoles', u'Madrid', u'CB Pontevedra', u'Pontevedra', u'Galicia', u'2015-03-01 09:00:00', u'2015-03-01 10:40:00'),
 (u'P2T3', u'F1', 3, u'CB Fuenla', u'Fuenlabrada', u'Madrid', u'CB Mostoles', u'Mostoles', u'Madrid', u'2015-09-01 09:00:00', u'2015-09-01 10:40:00'),
 (u'P1T4', u'G1', 4, u'CB Girona', u'Girona', u'Catalu\xf1a', u'CB Mostoles', u'Mostoles', u'Madrid', u'2016-03-01 09:00:00', u'2016-03-01 10:40:00'),
 (u'P2T4', u'M1', 4, u'CB Mostoles', u'Mostoles', u'Madrid', u'CB Cordoba', u'Cordoba', u'Andalucia', u'2016-09-01 09:00:00', u'2016-09-01 10:40:00')]

# POSICIONES

In [86]:
%%sql 
CREATE TABLE IF NOT EXISTS Posiciones
(tipo VARCHAR(15),
 PRIMARY KEY (tipo)
);

Done.
Done.

[]

In [87]:
%%sql
DELETE FROM Posiciones;
SELECT * FROM Posiciones

0 rows affected.
Done.

[]

In [88]:
%%sql
INSERT INTO Posiciones(tipo)
VALUES ('base');
INSERT INTO Posiciones(tipo)
VALUES ('escolta');
INSERT INTO Posiciones(tipo)
VALUES ('alero');
INSERT INTO Posiciones(tipo)
VALUES ('ala-pivot');
INSERT INTO Posiciones(tipo)
VALUES ('pivot');
INSERT INTO Posiciones(tipo)
VALUES ('banquillo');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [89]:
%sql SELECT * FROM Posiciones

Done.

[(u'base',),
 (u'escolta',),
 (u'alero',),
 (u'ala-pivot',),
 (u'pivot',),
 (u'banquillo',)]

# JUEGAN_EN_POS

In [96]:
%%sql
CREATE TABLE IF NOT EXISTS Juegan_En_Pos
(jugador VARCHAR(10),
 posicion VARCHAR(15),
 partido VARCHAR(10),
 hora_ini DATETIME,
 hora_fin DATETIME,
 PRIMARY KEY (jugador, posicion, partido),
 FOREIGN KEY (jugador) REFERENCES Jugadores(nif),
 FOREIGN KEY (posicion) REFERENCES Posiciones(tipo),
 FOREIGN KEY (partido) REFERENCES Partidos(ident)
);

Done.
Done.

[]

In [97]:
%%sql
DELETE FROM Juegan_En_Pos;
SELECT * FROM Juegan_En_Pos

0 rows affected.
Done.

[]

In [98]:
%%sql
INSERT INTO Juegan_En_Pos(jugador, posicion, partido, hora_ini, hora_fin)
VALUES ('15696688S', 'pivote', 'P1T1', '2013-03-01 09:00:00', '2013-03-01 10:40:00');
INSERT INTO Juegan_En_Pos(jugador, posicion, partido, hora_ini, hora_fin)
VALUES ('35492852T', 'banquillo', 'P2T1', '2013-09-01 09:00:00', '2013-09-01 10:40:00');
INSERT INTO Juegan_En_Pos(jugador, posicion, partido, hora_ini, hora_fin)
VALUES ('05885114Q', 'alero', 'P1T2', '2014-03-01 09:00:00', '2014-03-01 10:40:00');
INSERT INTO Juegan_En_Pos(jugador, posicion, partido, hora_ini, hora_fin)
VALUES ('25885116Q', 'escolta', 'P2T2', '2014-09-01 09:00:00', '2014-09-01 10:40:00');
INSERT INTO Juegan_En_Pos(jugador, posicion, partido, hora_ini, hora_fin)
VALUES ('25885116Q', 'escolta', 'P1T3', '2015-03-01 09:00:00', '2015-03-01 10:40:00');
INSERT INTO Juegan_En_Pos(jugador, posicion, partido, hora_ini, hora_fin)
VALUES ('15696688S', 'banquillo', 'P2T3', '2015-09-01 09:00:00', '2015-09-01 10:40:00');
INSERT INTO Juegan_En_Pos(jugador, posicion, partido, hora_ini, hora_fin)
VALUES ('25885116Q', 'base', 'P1T4', '2016-03-01 09:00:00', '2016-03-01 10:40:00');
INSERT INTO Juegan_En_Pos(jugador, posicion, partido, hora_ini, hora_fin)
VALUES ('35492852T', 'ala-pivot', 'P2T4', '2016-09-01 09:00:00', '2016-09-01 10:40:00');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [99]:
%sql SELECT * FROM Juegan_En_Pos

Done.

[(u'15696688S', u'pivote', u'P1T1', u'2013-03-01 09:00:00', u'2013-03-01 10:40:00'),
 (u'35492852T', u'banquillo', u'P2T1', u'2013-09-01 09:00:00', u'2013-09-01 10:40:00'),
 (u'05885114Q', u'alero', u'P1T2', u'2014-03-01 09:00:00', u'2014-03-01 10:40:00'),
 (u'25885116Q', u'escolta', u'P2T2', u'2014-09-01 09:00:00', u'2014-09-01 10:40:00'),
 (u'25885116Q', u'escolta', u'P1T3', u'2015-03-01 09:00:00', u'2015-03-01 10:40:00'),
 (u'15696688S', u'banquillo', u'P2T3', u'2015-09-01 09:00:00', u'2015-09-01 10:40:00'),
 (u'25885116Q', u'base', u'P1T4', u'2016-03-01 09:00:00', u'2016-03-01 10:40:00'),
 (u'35492852T', u'ala-pivot', u'P2T4', u'2016-09-01 09:00:00', u'2016-09-01 10:40:00')]

# TIEMPOS

In [102]:
%%sql
CREATE TABLE IF NOT EXISTS Tiempos
(numero INT,
 PRIMARY KEY (numero)
);

Done.

[]

In [103]:
%%sql
DELETE FROM Tiempos;
SELECT * FROM Tiempos

0 rows affected.
Done.

[]

In [104]:
%%sql
INSERT INTO Tiempos(numero)
VALUES (1);
INSERT INTO Tiempos(numero)
VALUES (2);
INSERT INTO Tiempos(numero)
VALUES (3);
INSERT INTO Tiempos(numero)
VALUES (4);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [105]:
%sql SELECT * FROM Tiempos

Done.

[(1,), (2,), (3,), (4,)]

# SE_DIVIDE_EN

In [109]:
%%sql
DROP TABLE Se_Divide_En;
CREATE TABLE IF NOT EXISTS Se_Divide_En
(partido VARCHAR(15),
 tiempo INT,
 hora_ini DATETIME,
 hora_fin DATETIME,
 puntuacion VARCHAR(10),
 PRIMARY KEY (partido, tiempo),
 FOREIGN KEY (partido) REFERENCES Partidos(ident),
 FOREIGN KEY (tiempo) REFERENCES Tiempos(numero)
);

Done.
Done.

[]

In [110]:
%%sql
DELETE FROM Se_Divide_En;
SELECT * FROM Se_Divide_En

0 rows affected.
Done.

[]

In [111]:
%%sql
INSERT INTO Se_Divide_En(partido, tiempo, hora_ini, hora_fin, puntuacion)
VALUES ('P1T1', 1, '2013-03-01 09:00:00', '2013-03-01 09:15:00', '22-34');
INSERT INTO Se_Divide_En(partido, tiempo, hora_ini, hora_fin, puntuacion)
VALUES ('P1T1', 2, '2013-03-01 09:25:00', '2013-03-01 09:40:00', '45-46');
INSERT INTO Se_Divide_En(partido, tiempo, hora_ini, hora_fin, puntuacion)
VALUES ('P1T1', 3, '2013-03-01 09:50:00', '2013-03-01 10:05:00', '52-60');
INSERT INTO Se_Divide_En(partido, tiempo, hora_ini, hora_fin, puntuacion)
VALUES ('P1T1', 4, '2013-03-01 10:25:00', '2013-03-01 10:40:00', '68-75');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [112]:
%sql SELECT * FROM Se_Divide_En

Done.

[(u'P1T1', 1, u'2013-03-01 09:00:00', u'2013-03-01 09:15:00', u'22-34'),
 (u'P1T1', 2, u'2013-03-01 09:25:00', u'2013-03-01 09:40:00', u'45-46'),
 (u'P1T1', 3, u'2013-03-01 09:50:00', u'2013-03-01 10:05:00', u'52-60'),
 (u'P1T1', 4, u'2013-03-01 10:25:00', u'2013-03-01 10:40:00', u'68-75')]